#### Terraform Format and Style 🖌`success`
#### Terraform Initialization ⚙️`success`
#### Terraform Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan 📖`success`

<details><summary>Show Plan</summary>

```

terraform
data.aws_iam_policy_document.aws_ebs_csi_driver_assume_role_document: Reading...
module.eks.data.aws_caller_identity.current[0]: Reading...
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Reading...
module.eks.module.kms.data.aws_partition.current[0]: Reading...
module.eks.module.kms.data.aws_caller_identity.current[0]: Reading...
data.aws_caller_identity.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Reading...
data.aws_iam_policy_document.aws_ebs_csi_driver_assume_role_document: Read complete after 0s [id=819195744]
module.eks.module.kms.data.aws_partition.current[0]: Read complete after 0s [id=aws]
module.vpc.aws_vpc.this[0]: Refreshing state... [id=vpc-0ef12896992ec0797]
module.eks.data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2830595799]
module.eks.module.eks_managed_node_group["default"].data.aws_iam_policy_document.assume_role_policy[0]: Read complete after 0s [id=2560088296]
module.eks.aws_cloudwatch_log_group.this[0]: Refreshing state... [id=/aws/eks/common-eks/cluster]
module.eks.data.aws_partition.current[0]: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Reading...
module.eks.module.eks_managed_node_group["default"].data.aws_partition.current: Read complete after 0s [id=aws]
module.eks.data.aws_partition.current[0]: Read complete after 0s [id=aws]
aws_iam_role.aws_ebs_csi_driver_assume_role: Refreshing state... [id=AmazonEBSCSIDriverRole]
module.eks.aws_iam_role.this[0]: Refreshing state... [id=common-eks-cluster-20250209043915191100000003]
module.eks.module.eks_managed_node_group["default"].aws_iam_role.this[0]: Refreshing state... [id=default-eks-node-group-20250209043915190000000002]
module.eks.data.aws_iam_policy_document.custom[0]: Reading...
module.eks.data.aws_iam_policy_document.custom[0]: Read complete after 0s [id=513122117]
module.eks.aws_iam_policy.custom[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-20250209043915189600000001]
module.eks.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_session_context.current[0]: Reading...
data.aws_caller_identity.current: Read complete after 0s [id=183631350996]
module.eks.module.eks_managed_node_group["default"].data.aws_caller_identity.current: Read complete after 0s [id=183631350996]
module.eks.module.kms.data.aws_caller_identity.current[0]: Read complete after 0s [id=183631350996]
module.eks.data.aws_iam_session_context.current[0]: Read complete after 0s [id=arn:aws:sts::183631350996:assumed-role/IaC-ReadOnly/GitHubActions]
aws_iam_role_policy_attachment.test-attach: Refreshing state... [id=AmazonEBSCSIDriverRole-20250209043916017800000005]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKSWorkerNodePolicy"]: Refreshing state... [id=default-eks-node-group-20250209043915190000000002-20250209043916046600000007]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEC2ContainerRegistryReadOnly"]: Refreshing state... [id=default-eks-node-group-20250209043915190000000002-20250209043916028700000006]
module.eks.module.eks_managed_node_group["default"].aws_iam_role_policy_attachment.this["AmazonEKS_CNI_Policy"]: Refreshing state... [id=default-eks-node-group-20250209043915190000000002-20250209043916003100000004]
module.eks.aws_iam_role_policy_attachment.custom[0]: Refreshing state... [id=common-eks-cluster-20250209043915191100000003-20250209043916138200000008]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSVPCResourceController"]: Refreshing state... [id=common-eks-cluster-20250209043915191100000003-20250209043916155800000009]
module.eks.aws_iam_role_policy_attachment.this["AmazonEKSClusterPolicy"]: Refreshing state... [id=common-eks-cluster-20250209043915191100000003-2025020904391617120000000a]
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Reading...
module.eks.module.kms.data.aws_iam_policy_document.this[0]: Read complete after 0s [id=252560858]
module.eks.module.kms.aws_kms_key.this[0]: Refreshing state... [id=b478d09c-6112-43e3-84b1-a04d906340e1]
module.eks.module.kms.aws_kms_alias.this["cluster"]: Refreshing state... [id=alias/eks/common-eks]
module.eks.aws_iam_policy.cluster_encryption[0]: Refreshing state... [id=arn:aws:iam::183631350996:policy/common-eks-cluster-ClusterEncryption20250209043937610600000010]
module.vpc.aws_default_route_table.default[0]: Refreshing state... [id=rtb-06ad41632338d82c8]
module.vpc.aws_default_security_group.this[0]: Refreshing state... [id=sg-0ed355d717fe5fae1]
module.vpc.aws_default_network_acl.this[0]: Refreshing state... [id=acl-09d410a25f266ce2e]
module.vpc.aws_route_table.public[0]: Refreshing state... [id=rtb-0f554ec63a69da695]
module.vpc.aws_route_table.private[0]: Refreshing state... [id=rtb-0cfac6eb4255c7f40]
module.vpc.aws_subnet.public[1]: Refreshing state... [id=subnet-0070f70d815eb64a5]
module.eks.aws_security_group.cluster[0]: Refreshing state... [id=sg-094e50534e0953f8e]
module.vpc.aws_subnet.public[0]: Refreshing state... [id=subnet-0c8e7e8247d6ad5a2]
module.eks.aws_security_group.node[0]: Refreshing state... [id=sg-07ff573c5fbfd7cbc]
module.vpc.aws_subnet.public[2]: Refreshing state... [id=subnet-01d6f266b3222df4d]
module.vpc.aws_internet_gateway.this[0]: Refreshing state... [id=igw-01a3e053087c48b3b]
module.vpc.aws_subnet.private[0]: Refreshing state... [id=subnet-02ec6a3417981cb55]
module.vpc.aws_subnet.private[1]: Refreshing state... [id=subnet-0962e3a3eb7da0ea2]
module.vpc.aws_subnet.private[2]: Refreshing state... [id=subnet-06be6bcd0c3c354ab]
module.eks.aws_iam_role_policy_attachment.cluster_encryption[0]: Refreshing state... [id=common-eks-cluster-20250209043915191100000003-20250209043938121900000011]
module.vpc.aws_eip.nat[0]: Refreshing state... [id=eipalloc-0d1fcfce99b5eaf03]
module.vpc.aws_route.public_internet_gateway[0]: Refreshing state... [id=r-rtb-0f554ec63a69da6951080289494]
module.eks.aws_security_group_rule.node["ingress_cluster_kubelet"]: Refreshing state... [id=sgrule-3085860590]
module.eks.aws_security_group_rule.node["ingress_cluster_8443_webhook"]: Refreshing state... [id=sgrule-1523481636]
module.eks.aws_security_group_rule.node["ingress_cluster_9443_webhook"]: Refreshing state... [id=sgrule-1047482351]
module.eks.aws_security_group_rule.node["egress_all"]: Refreshing state... [id=sgrule-2288347239]
module.eks.aws_security_group_rule.node["ingress_self_coredns_tcp"]: Refreshing state... [id=sgrule-2436655306]
module.eks.aws_security_group_rule.node["ingress_cluster_443"]: Refreshing state... [id=sgrule-3429405641]
module.eks.aws_security_group_rule.node["ingress_cluster_4443_webhook"]: Refreshing state... [id=sgrule-2161125267]
module.eks.aws_security_group_rule.node["ingress_cluster_6443_webhook"]: Refreshing state... [id=sgrule-1234321413]
module.eks.aws_security_group_rule.node["ingress_nodes_ephemeral"]: Refreshing state... [id=sgrule-2058274856]
module.eks.aws_security_group_rule.node["ingress_self_coredns_udp"]: Refreshing state... [id=sgrule-895732517]
module.eks.aws_security_group_rule.cluster["ingress_nodes_443"]: Refreshing state... [id=sgrule-3007136810]
module.vpc.aws_route_table_association.public[1]: Refreshing state... [id=rtbassoc-0267cd12311b1692c]
module.vpc.aws_route_table_association.public[2]: Refreshing state... [id=rtbassoc-0068701b23f737ba9]
module.vpc.aws_route_table_association.public[0]: Refreshing state... [id=rtbassoc-0b4b836302eb61ba0]
module.vpc.aws_route_table_association.private[1]: Refreshing state... [id=rtbassoc-01afffc8440da0c21]
module.vpc.aws_route_table_association.private[2]: Refreshing state... [id=rtbassoc-05c5448cec4cde0f7]
module.vpc.aws_route_table_association.private[0]: Refreshing state... [id=rtbassoc-056ad9babc3e58bbb]
module.vpc.aws_nat_gateway.this[0]: Refreshing state... [id=nat-009a687d474a77c4c]
module.eks.aws_eks_cluster.this[0]: Refreshing state... [id=common-eks]
module.vpc.aws_route.private_nat_gateway[0]: Refreshing state... [id=r-rtb-0cfac6eb4255c7f401080289494]
module.eks.aws_eks_access_entry.this["github_action_ci"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:role/IaC]
module.eks.aws_eks_access_entry.this["root_user"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:root]
module.eks.time_sleep.this[0]: Refreshing state... [id=2025-02-09T04:50:05Z]
module.eks.aws_eks_addon.before_compute["vpc-cni"]: Refreshing state... [id=common-eks:vpc-cni]
module.eks.aws_eks_access_entry.this["github_action_ci_read_only"]: Refreshing state... [id=common-eks:arn:aws:iam::183631350996:role/IaC-ReadOnly]
module.eks.aws_iam_openid_connect_provider.oidc_provider[0]: Refreshing state... [id=arn:aws:iam::183631350996:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/17E048D5D70FE67E9CB91F25370FA6DF]
module.eks.aws_eks_addon.before_compute["metrics-server"]: Refreshing state... [id=common-eks:metrics-server]
module.eks.module.eks_managed_node_group["default"].module.user_data.null_resource.validate_cluster_service_cidr: Refreshing state... [id=5344179828609315233]
module.eks.module.eks_managed_node_group["default"].aws_launch_template.this[0]: Refreshing state... [id=lt-0630bce7485115696]
module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0]: Refreshing state... [id=common-eks:default-20250209045011905900000016]
module.eks.aws_eks_access_policy_association.this["github_action_ci_github_action_ci"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:role/IaC#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_access_policy_association.this["github_action_ci_read_only_github_action_ci_read_only"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:role/IaC-ReadOnly#arn:aws:eks::aws:cluster-access-policy/AmazonEKSAdminViewPolicy]
module.eks.aws_eks_access_policy_association.this["root_user_root_user"]: Refreshing state... [id=common-eks#arn:aws:iam::183631350996:root#arn:aws:eks::aws:cluster-access-policy/AmazonEKSClusterAdminPolicy]
module.eks.aws_eks_addon.this["kube-proxy"]: Refreshing state... [id=common-eks:kube-proxy]
module.eks.aws_eks_addon.this["aws-ebs-csi-driver"]: Refreshing state... [id=common-eks:aws-ebs-csi-driver]
module.eks.aws_eks_addon.this["coredns"]: Refreshing state... [id=common-eks:coredns]
module.eks.aws_eks_addon.this["eks-pod-identity-agent"]: Refreshing state... [id=common-eks:eks-pod-identity-agent]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply" which may have affected this plan:

  # module.eks.module.eks_managed_node_group["default"].aws_eks_node_group.this[0] has changed
  ~ resource "aws_eks_node_group" "this" {
        id                     = "common-eks:default-20250209045011905900000016"
      + labels                 = {}
        tags                   = {
            "Name" = "default"
        }
        # (15 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
  - destroy
 <= read (data resources)

Terraform will perform the following actions:

  # module.eks.data.aws_eks_addon_version.this["aws-ebs-csi-driver"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "aws-ebs-csi-driver"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["coredns"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "coredns"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["eks-pod-identity-agent"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "eks-pod-identity-agent"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["kube-proxy"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "kube-proxy"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["metrics-server"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "metrics-server"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.aws_eks_addon_version.this["vpc-cni"] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "aws_eks_addon_version" "this" {
      + addon_name         = "vpc-cni"
      + id                 = (known after apply)
      + kubernetes_version = "1.31"
      + version            = (known after apply)
    }

  # module.eks.data.tls_certificate.this[0] will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "tls_certificate" "this" {
      + certificates = (known after apply)
      + id           = (known after apply)
      + url          = "https://oidc.eks.us-east-1.amazonaws.com/id/17E048D5D70FE67E9CB91F25370FA6DF"
    }

  # module.eks.aws_eks_addon.before_compute["metrics-server"] will be destroyed
  # (because key ["metrics-server"] is not in for_each map)
  - resource "aws_eks_addon" "before_compute" {
      - addon_name                  = "metrics-server" -> null
      - addon_version               = "v0.7.2-eksbuild.1" -> null
      - arn                         = "arn:aws:eks:us-east-1:183631350996:addon/common-eks/metrics-server/a8ca7485-5234-fabf-4044-176b5f6f430e" -> null
      - cluster_name                = "common-eks" -> null
      - created_at                  = "2025-02-09T04:49:36Z" -> null
      - id                          = "common-eks:metrics-server" -> null
      - modified_at                 = "2025-02-09T05:04:39Z" -> null
      - preserve                    = true -> null
      - resolve_conflicts_on_create = "NONE" -> null
      - resolve_conflicts_on_update = "OVERWRITE" -> null
      - tags_all                    = {
          - "Created_by"  = "Terraform"
          - "Environment" = "Common"
          - "Owner"       = "TF"
        } -> null
        # (2 unchanged attributes hidden)

      - timeouts {}
    }

  # module.eks.aws_eks_addon.before_compute["vpc-cni"] will be updated in-place
  ~ resource "aws_eks_addon" "before_compute" {
      ~ addon_version               = "v1.19.0-eksbuild.1" -> (known after apply)
        id                          = "common-eks:vpc-cni"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["aws-ebs-csi-driver"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.39.0-eksbuild.1" -> (known after apply)
        id                          = "common-eks:aws-ebs-csi-driver"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.eks.aws_eks_addon.this["coredns"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.11.3-eksbuild.1" -> (known after apply)
        id                          = "common-eks:coredns"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["eks-pod-identity-agent"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.3.4-eksbuild.1" -> (known after apply)
        id                          = "common-eks:eks-pod-identity-agent"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["kube-proxy"] will be updated in-place
  ~ resource "aws_eks_addon" "this" {
      ~ addon_version               = "v1.31.2-eksbuild.3" -> (known after apply)
        id                          = "common-eks:kube-proxy"
        tags                        = {}
        # (11 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.eks.aws_eks_addon.this["metrics-server"] will be created
  + resource "aws_eks_addon" "this" {
      + addon_name                  = "metrics-server"
      + addon_version               = (known after apply)
      + arn                         = (known after apply)
      + cluster_name                = "common-eks"
      + configuration_values        = (known after apply)
      + created_at                  = (known after apply)
      + id                          = (known after apply)
      + modified_at                 = (known after apply)
      + preserve                    = true
      + resolve_conflicts_on_create = "NONE"
      + resolve_conflicts_on_update = "OVERWRITE"
      + tags_all                    = {
          + "Created_by"  = "Terraform"
          + "Environment" = "Common"
          + "Owner"       = "TF"
        }

      + timeouts {}
    }

  # module.eks.aws_eks_cluster.this[0] will be updated in-place
  ~ resource "aws_eks_cluster" "this" {
        id                            = "common-eks"
        name                          = "common-eks"
        tags                          = {
            "terraform-aws-modules" = "eks"
        }
        # (12 unchanged attributes hidden)

      ~ upgrade_policy {
          ~ support_type = "EXTENDED" -> "STANDARD"
        }

        # (5 unchanged blocks hidden)
    }

  # module.eks.aws_iam_openid_connect_provider.oidc_provider[0] will be updated in-place
  ~ resource "aws_iam_openid_connect_provider" "oidc_provider" {
        id              = "arn:aws:iam::183631350996:oidc-provider/oidc.eks.us-east-1.amazonaws.com/id/17E048D5D70FE67E9CB91F25370FA6DF"
        tags            = {
            "Name" = "common-eks-eks-irsa"
        }
      ~ thumbprint_list = [
          - "9e99a48a9960b14926bb7f3b02e22da2b0ab7280",
        ] -> (known after apply)
        # (4 unchanged attributes hidden)
    }

  # module.eks.module.kms.aws_kms_key.this[0] will be updated in-place
  ~ resource "aws_kms_key" "this" {
        id                                 = "b478d09c-6112-43e3-84b1-a04d906340e1"
      ~ policy                             = jsonencode(
          ~ {
              ~ Statement = [
                    {
                        Action    = "kms:*"
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:root"
                        }
                        Resource  = "*"
                        Sid       = "Default"
                    },
                  ~ {
                      ~ Principal = {
                          ~ AWS = "arn:aws:iam::183631350996:role/IaC" -> "arn:aws:iam::183631350996:role/IaC-ReadOnly"
                        }
                        # (4 unchanged attributes hidden)
                    },
                    {
                        Action    = [
                            "kms:ReEncrypt*",
                            "kms:GenerateDataKey*",
                            "kms:Encrypt",
                            "kms:DescribeKey",
                            "kms:Decrypt",
                        ]
                        Effect    = "Allow"
                        Principal = {
                            AWS = "arn:aws:iam::183631350996:role/common-eks-cluster-20250209043915191100000003"
                        }
                        Resource  = "*"
                        Sid       = "KeyUsage"
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        tags                               = {
            "terraform-aws-modules" = "eks"
        }
        # (13 unchanged attributes hidden)
    }

Plan: 1 to add, 8 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>

*Pusher: @yashrajdighe, Action: `pull_request`, Working Directory: ``, Workflow: `terraform-plan`*